{"index":{"_index":"oci","_id":1}}
{"id":1,"title":"Region","category":"Generic","url":"https://docs.oracle.com/en-us/iaas/Content/General/Concepts/regions.htm","text":"Oracle Cloud Infrastructure is hosted in regions and availability domains. A region is a localized geographic area, and an availability domain is one or more data centers located within a region. A region is composed of one or more availability domains. Most Oracle Cloud Infrastructure resources are either region-specific, such as a virtual cloud network, or availability domain-specific, such as a compute instance. Traffic between availability domains and between regions is encrypted. Availability domains are isolated from each other, fault tolerant, and very unlikely to fail simultaneously. Because availability domains do not share infrastructure such as power or cooling, or the internal availability domain network, a failure at one availability domain within a region is unlikely to impact the availability of the others within the same region."}
{"index":{"_index":"oci","_id":2}}
{"id":2,"title":"Availability domain","category":"Generic","url":"https://docs.oracle.com/en-us/iaas/Content/General/Concepts/regions.htm","text":"Oracle Cloud Infrastructure is hosted in regions and availability domains. A region is a localized geographic area, and an availability domain is one or more data centers located within a region. A region is composed of one or more availability domains. Most Oracle Cloud Infrastructure resources are either region-specific, such as a virtual cloud network, or availability domain-specific, such as a compute instance. Traffic between availability domains and between regions is encrypted. Availability domains are isolated from each other, fault tolerant, and very unlikely to fail simultaneously. Because availability domains do not share infrastructure such as power or cooling, or the internal availability domain network, a failure at one availability domain within a region is unlikely to impact the availability of the others within the same region."}
{"index":{"_index":"oci","_id":3}}
{"id":3,"title":"Fault domains","category":"Generic","url":"https://docs.oracle.com/en-us/iaas/Content/General/Concepts/regions.htm#fault","text":"A fault domain is a grouping of hardware and infrastructure within an availability domain. Each availability domain contains three fault domains. Fault domains provide anti-affinity: they let you distribute your instances so that the instances are not on the same physical hardware within a single availability domain. A hardware failure or Compute hardware maintenance event that affects one fault domain does not affect instances in other fault domains. In addition, the physical hardware in a fault domain has independent and redundant power supplies, which prevents a failure in the power supply hardware within one fault domain from affecting other fault domains."}
{"index":{"_index":"oci","_id":4}}
{"id":4,"title":"Tenancy","category":"Generic","url":"https://docs.oracle.com/en-us/iaas/Content/Identity/Tasks/managingtenancy.htm","text":"When you sign up for Oracle Cloud Infrastructure, Oracle creates a tenancy for you in one of the available regions."}
{"index":{"_index":"oci","_id":5}}
{"id":5,"title":"Compartments","category":"Generic","url":"https://docs.oracle.com/en-us/iaas/Content/Identity/Tasks/managingcompartments.htm","text":"When you first start working with Oracle Cloud Infrastructure, you need to think carefully about how you want to use compartments to organize and isolate your cloud resources. Compartments are fundamental to that process. Most resources can be moved between compartments. However, it's important to think through your compartment design for your organization up front, before implementing anything. "}
{"index":{"_index":"oci","_id":6}}
{"id":6,"title":"OCI Tagging","category":"Generic","url":"https://docs.oracle.com/en-us/iaas/Content/Tagging/Concepts/taggingoverview.htm","text":"Oracle Cloud Infrastructure Tagging allows you to add metadata to resources, which enables you to define keys and values and associate them with resources. You can use the tags to organize and list resources based on your business needs."}
{"index":{"_index":"oci","_id":7}}
{"id":7,"title":"OCI Virtual Machine Instances","category":"Compute","url":"https://www.oracle.com/cloud/compute/virtual-machines/","text":"Virtual machines (VM) provide secure and elastic compute capacity in the cloud for workloads ranging from small development projects to large-scale, global applications such as real-time communication platforms. Flexible shapes enable users to optimize VM resources with customized processor and memory values for improved price-performance."}
{"index":{"_index":"oci","_id":8}}
{"id":8,"title":"OCI Dedicated Virtual Machine Hosts","category":"Compute","url":"https://docs.oracle.com/en-us/iaas/Content/Compute/Concepts/dedicatedvmhosts.htm","text":"The Oracle Cloud Infrastructure Compute service's dedicated virtual machine host feature gives you the ability to run compute virtual machine (VM) instances on dedicated servers that are a single tenant and not shared with other customers. This feature lets you meet compliance and regulatory requirements for isolation that prevent you from using shared infrastructure. You can also use this feature to meet node-based or host-based licensing requirements that require you to license an entire server."}
{"index":{"_index":"oci","_id":9}}
{"id":9,"title":"OCI Bare Metal Instances","category":"Compute","url":"https://www.oracle.com/cloud/compute/bare-metal.html","text":"Oracle's bare metal servers provide customers with isolation, visibility, and control by using dedicated compute instances. The servers support applications that require high core counts, large amounts of memory, and high bandwidth-scaling up to 160 cores (the largest in the industry), 2 TB of RAM, and up to 1 PB of block storage. Customers can build cloud environments in Oracle's bare metal servers with significant performance improvements over other public clouds and on-premises data centers."}
{"index":{"_index":"oci","_id":10}}
{"id":10,"title":"Oracle Container Engine for Kubernetes","category":"Compute","url":"https://www.oracle.com/cloud-native/container-engine-kubernetes/","text":"Oracle Container Engine for Kubernetes is an Oracle-managed container orchestration service that can reduce the time and cost to build modern cloud native applications. Unlike most other vendors, Oracle Cloud Infrastructure provides Container Engine for Kubernetes as a free service that runs on higher-performance, lower-cost compute shapes. DevOps engineers can use unmodified, open source Kubernetes for application workload portability and to simplify operations with automatic updates and patching."}
{"index":{"_index":"oci","_id":11}}
{"id":11,"title":"OCI Registry","category":"Compute","url":"https://www.oracle.com/cloud-native/container-registry/","text":"Oracle Cloud Infrastructure Container Registry is an open standards-based, Oracle-managed Docker registry service for securely storing and sharing container images. Engineers can easily push and pull Docker images with the familiar Docker Command Line Interface (CLI) and API. To support container lifecycles, Registry works with Container Engine for Kubernetes, Identity and Access Management (IAM), Visual Builder Studio, and third-party developer and DevOps tools."}
{"index":{"_index":"oci","_id":12}}
{"id":12,"title":"Oracle Functions","category":"Compute","url":"https://www.oracle.com/cloud-native/functions/","text":"Oracle Cloud Functions is a serverless platform that lets developers create, run, and scale applications without managing any infrastructure. Functions integrate with Oracle Cloud Infrastructure, platform services and SaaS applications. Because Functions is based on the open source Fn Project, developers can create applications that can be easily ported to other cloud and on-premises environments. Code based on Functions typically runs for short durations, and customers pay only for the resources they use."}
{"index":{"_index":"oci","_id":13}}
{"id":13,"title":"Object Storage","category":"Storage","url":"https://www.oracle.com/cloud/storage/object-storage.html","text":"Oracle Cloud Infrastructure (OCI) Object Storage enables customers to securely store any type of data in its native format. With built-in redundancy, OCI Object Storage is ideal for building modern applications that require scale and flexibility, as it can be used to consolidate multiple data sources for analytics, backup, or archive purposes."}
{"index":{"_index":"oci","_id":14}}
{"id":14,"title":"Archive Storage","category":"Storage","url":"https://www.oracle.com/cloud/storage/archive-storage.html","text":"Customers trust Oracle Cloud Infrastructure (OCI) Archive Storage to securely store any type of data in its native format. This cost-effective solution is highly durable and used for storing and managing encrypted data for long periods of time."}
{"index":{"_index":"oci","_id":15}}
{"id":15,"title":"Block Volumes","category":"Storage","url":"https://www.oracle.com/cloud/storage/block-volumes.html","text":"Oracle Cloud Infrastructure Block Volume provide customers reliable, high-performance block storage designed to work with a range of virtual machines and bare metal instances. With built-in redundancy, Block Volumes are persistent and durable beyond the lifespan of a virtual machine and can scale to 1 PB per compute instance."}
{"index":{"_index":"oci","_id":16}}
{"id":16,"title":"File Storage","category":"Storage","url":"https://www.oracle.com/cloud/storage/file-storage.html","text":"Oracle Cloud Infrastructure (OCI) File Storage is a fully managed elastic file system built for the cloud that enables customers to migrate their enterprise workloads to the cloud. Every file system scales automatically to accommodate the growth of up to 8 exabytes. File Storage eliminates the need to provision capacity in advance, so customers pay only for the capacity they need. File Storage also offers snapshot and clone capabilities to simplify business continuity for enterprise applications."}
{"index":{"_index":"oci","_id":17}}
{"id":17,"title":"Data Transfer Appliance","category":"Storage","url":"https://www.oracle.com/cloud/storage/data-transfer.html","text":"Data Transfer Appliance securely moves terabytes or petabytes data between on-premises data centers and the cloud. The service can reduce data migration times from weeks or months to just days, and is available for data import to the cloud and data export from the cloud."}
{"index":{"_index":"oci","_id":18}}
{"id":18,"title":"Storage Gateway","category":"Storage","url":"https://www.oracle.com/cloud/storage/storage-gateway.html","text":"Customers use Oracle Cloud Infrastructure (OCI) Storage Gateway to extend on-premises application data to Oracle Cloud. Integration with OCI Object Storage and Network File Storage (NFS) compliance make it easy to securely move files to and from Oracle Cloud. Data is encrypted both at rest and in-transit and built-in data integrity checks provides protection. Local caching provides enterprise applications instant access to files that are frequently used."}
{"index":{"_index":"oci","_id":19}}
{"id":19,"title":"Virtual Cloud Network (VCN)","category":"Networking and Edge","url":"https://www.oracle.com/cloud/networking/virtual-cloud-network/","text":"Oracle virtual cloud networks (VCNs) provide customizable and private cloud networks in Oracle Cloud Infrastructure (OCI). Just like a traditional data center network, the VCN provides customers with complete control over their cloud networking environment. This includes assigning private IP address spaces, creating subnets and route tables, and configuring stateful firewalls."}
{"index":{"_index":"oci","_id":20}}
{"id":20,"title":"FastConnect","category":"Networking and Edge","url":"https://www.oracle.com/cloud/networking/fastconnect/","text":"FastConnect allows customers to connect directly to their Oracle Cloud Infrastructure (OCI) virtual cloud network via dedicated, private, high-bandwidth connections. Then, based on the amount of data, customers simply choose an appropriate port speed and pay a consistent, low price each month. Other providers charge for the amount of data moved, which can be expensive and unpredictable."}
{"index":{"_index":"oci","_id":21}}
{"id":21,"title":"VPN Connect","category":"Networking and Edge","url":"https://www.oracle.com/cloud/networking/vpn-connect.html","text":"VPN Connect offers a simple and secure way to connect your corporate network to Oracle Cloud Infrastructure over your existing internet connection. The data is encrypted using industry-standard encryption algorithms called IPSec and is then tunneled through the public internet for enhanced security and privacy."}
{"index":{"_index":"oci","_id":22}}
{"id":22,"title":"OCI Domain Name System (DNS)","category":"Networking and Edge","url":"https://www.oracle.com/cloud/networking/dns/","text":"The Domain Name System (DNS) is a distributed internet system that maps human-readable names (like www.Oracle.com) to IP addresses and serves as the first link in the customers' digital supply chain. Oracle's globally distributed DNS service offers enhanced DNS performance, resiliency, and scalability, so that end users connect to customers' application as quickly as possible, from wherever they are."}
{"index":{"_index":"oci","_id":23}}
{"id":23,"title":"OCI Traffic Management","category":"Networking and Edge","url":"https://www.oracle.com/cloud/networking/traffic-management.html","text":"Traffic management-a critical component of DNS-enables users to configure routing policies to serve intelligent responses to DNS queries. Oracle Traffic Management steering policies are used to steer DNS traffic across multiple public Oracle Cloud Infrastructure instances and other private and third-party assets."}
{"index":{"_index":"oci","_id":24}}
{"id":24,"title":"OCI Load Balancing","category":"Networking and Edge","url":"https://www.oracle.com/cloud/networking/load-balancing/","text":"Oracle Cloud Infrastructure (OCI) Flexible Load Balancing enables customers to distribute web requests across a fleet of servers or automatically route traffic across fault domains, availability domains, or regions-yielding high availability and fault tolerance for any application or data source. The portfolio comprises two services-Oracle Cloud Infrastructure Flexible Load Balancer (OCI Load Balancer) and Oracle Cloud Infrastructure Flexible Network Load Balancer (OCI Network Load Balancer)."}
{"index":{"_index":"oci","_id":25}}
{"id":25,"title":"Email Delivery","category":"Networking and Edge","url":"https://www.oracle.com/cloud/networking/email-delivery.html","text":"Oracle Cloud Infrastructure Email Delivery helps organizations reach their intended audiences by enabling them to send bulk email with high rates of successful inbox placement. With email message volume rising every year, reaching intended recipients continues to be a significant challenge, even for reputable senders. Email Delivery, built on Oracle Dyn's proven technology, makes that challenge exponentially easier."}
{"index":{"_index":"oci","_id":26}}
{"id":26,"title":"Web Application Firewall","category":"Networking and Edge","url":"https://www.oracle.com/security/cloud-security/web-application-firewall/","text":"Protect applications from malicious and unwanted internet traffic with a cloud-based, PCI-compliant, global web application firewall service. By combining threat intelligence with consistent rule enforcement on Oracle Flexible Load Balancer, Oracle Cloud Infrastructure Web Application Firewall strengthens defenses and protects internet-facing application servers and internal applications."}
{"index":{"_index":"oci","_id":27}}
{"id":27,"title":"DDoS Protection","category":"Networking and Edge","url":"https://docs.oracle.com/en-us/iaas/Content/WAF/Concepts/ddos.htm","text":"A DDoS attack is an often intentional attack that consumes an entity's resources, usually using a large number of distributed sources. DDoS can be categorized into either Layer 7 or Layer 3/4 (L3/4), as defined by the Open Systems Interconnection (OSI) model. L3/4 DDoS attacks are DDoS attacks that occur at lower levels of the OSI stack than layer 7. Examples of such attacks include UDP, CharGen, and NTP Floods. L3/4 DDoS mitigation is inherently provided by Oracle Cloud Infrastructure."}
{"index":{"_index":"oci","_id":28}}
{"id":28,"title":"Oracle Autonomous Transaction Processing (ATP)","category":"Database","url":"https://www.oracle.com/autonomous-database/autonomous-transaction-processing/","text":"A fully automated database service optimized to run transactional, analytical, and batch workloads concurrently. To accelerate performance, it is preconfigured for row format, indexes, and data caching, while providing scalability, availability, transparent security, and real-time operational analytics. With Autonomous Database, application developers and DBAs can rapidly, easily, and cost-effectively develop and deploy applications without sacrificing functionality or ACID (atomicity, consistency, isolation, durability) properties. Built on Oracle Database and Oracle Exadata, Autonomous Database is available on Oracle Cloud Infrastructure for shared or dedicated deployments, and on-premises with Exadata Cloud@Customer and Dedicated Region Cloud@Customer."}
{"index":{"_index":"oci","_id":29}}
{"id":29,"title":"Oracle MySQL Database Service","category":"Database","url":"https://www.oracle.com/mysql/","text":"Oracle MySQL HeatWave is a fully managed database service. For database admins and application developers, it's the only service that enables them to run OLTP and OLAP workloads directly from their MySQL database. Since MySQL is optimized for OLTP, many MySQL implementations use a separate OLAP database for business analytics. MySQL HeatWave is designed to enable customers to run analytics on data that is stored in MySQL databases, eliminating the need for the complex, time-consuming and expensive data movement and integration across OLTP and OLAP databases. MySQL HeatWave is 6.5X faster than Amazon Redshift at half the cost, 7X faster than Snowflake at one-fifth the cost, and 1400X faster than Amazon Aurora at half the cost. MySQL Autopilot uses advanced machine-learning techniques to automate HeatWave, making it easier to use and further improving performance and scalability."}
{"index":{"_index":"oci","_id":30}}
{"id":30,"title":"Oracle NoSQL Database","category":"Database","url":"https://www.oracle.com/database/nosql-cloud.html","text":"Oracle NoSQL Database Cloud Service makes it easy for developers to build applications using document, columnar and key-value database models, delivering predictable single digit millisecond response times with data replication for high availability. The service offers ACID transactions, serverless scaling, comprehensive security, and low pay-per-use pricing, including 100% compatibility with on-premises Oracle NoSQL Database."}
{"index":{"_index":"oci","_id":31}}
{"id":31,"title":"Oracle Autonomous JSON Database (AJD)","category":"Database","url":"https://www.oracle.com/autonomous-database/autonomous-json-database/","text":"Oracle Autonomous JSON Database is a cloud document database service that makes it simple to develop JSON-centric applications. It features NoSQL-style document APIs (Oracle SODA and Oracle Database API for MongoDB), serverless scaling, high performance ACID transactions, comprehensive security, and low pay-per-use pricing. Autonomous JSON Database automates provisioning, configuring, tuning, scaling, patching, encrypting, and repairing of databases, eliminating database management and delivering 99.95% availability."}
{"index":{"_index":"oci","_id":32}}
{"id":32,"title":"Oracle Autonomous Data Warehouse (ADW)","category":"Database","url":"https://www.oracle.com/autonomous-database/autonomous-data-warehouse/","text":"A fully automated cloud database service optimized for analytic workloads, including data marts, data warehouses, and data lakes. It is preconfigured with columnar format, partitioning, and large joins to simplify and accelerate database provisioning, extracting, loading, and transforming data; running sophisticated reports; generating predictions; and creating machine learning models. With Autonomous Database, data scientists, business analysts, and non-experts can rapidly, easily, and cost-effectively discover business insights using data of any size and type. Built on Oracle Database and Oracle Exadata, Autonomous Database is available on Oracle Cloud Infrastructure for shared or dedicated deployments, and on-premises with Exadata Cloud@Customer and Dedicated Region Cloud@Customer."}
{"index":{"_index":"oci","_id":33}}
{"id":33,"title":"Oracle MySQL HeatWave","category":"Database","url":"https://www.oracle.com/mysql/heatwave/","text":"Oracle MySQL HeatWave is the only MySQL cloud service with a built-in, high performance, in-memory query accelerator-HeatWave. It increases MySQL performance by orders of magnitude for analytics and mixed workloads, without any changes to existing applications. With HeatWave enabled, MySQL HeatWave is 6.5X faster than Amazon Redshift at half the cost, 7X faster than Snowflake at one-fifth the cost, and 1400X faster than Amazon Aurora at half the cost. MySQL HeatWave provides a single, unified platform for transactional and analytics workloads. This eliminates the need for the complex, time-consuming, expensive ETL and integration with a separate analytics database. HeatWave's MySQL Autopilot automates provisioning, data loading, query execution, and failure handling-saving developers and DBAs significant time."}
{"index":{"_index":"oci","_id":34}}
{"id":34,"title":"OCI Data Flow","category":"Data and Analytics","url":"https://www.oracle.com/big-data/data-flow/","text":"Oracle Cloud Infrastructure (OCI) Data Flow is a fully managed Apache Spark service to perform processing tasks on extremely large data sets without infrastructure to deploy or manage. This enables rapid application delivery because developers can focus on app development, not infrastructure management."}
{"index":{"_index":"oci","_id":35}}
{"id":35,"title":"Oracle Big Data Service","category":"Data and Analytics","url":"https://www.oracle.com/big-data/big-data-service/","text":"Oracle Big Data Service is a fully managed, automated cloud service that provides enterprises with a cost-effective Hadoop environment. Customers easily create secure and scalable Hadoop-based data lakes that can quickly process large amounts of data."}
{"index":{"_index":"oci","_id":36}}
{"id":36,"title":"OCI Streaming","category":"Data and Analytics","url":"https://www.oracle.com/cloud-native/streaming/","text":"Streaming service is a real-time, serverless, Apache Kafka-compatible event streaming platform for developers and data scientists. Streaming is tightly integrated with Oracle Cloud Infrastructure (OCI), Database, GoldenGate, and Integration Cloud. The service also provides out-of-the-box integrations for hundreds of third-party products across categories such as DevOps, databases, big data, and SaaS applications."}
{"index":{"_index":"oci","_id":37}}
{"id":37,"title":"Oracle Analytics Cloud","category":"Data and Analytics","url":"https://www.oracle.com/business-analytics/analytics-cloud.html","text":"The Oracle Analytics platform is a cloud-native service that provides the capabilities required to address the entire analytics process from data ingestion and modeling, through data preparation and enrichment, to visualization and collaboration without compromising security and governance. Embedded machine learning and natural language processing technologies help increase productivity and build an analytics-driven culture in organizations. Start on-premises or in the cloud-Oracle Analytics supports a hybrid deployment strategy, providing flexible paths to the cloud."}
{"index":{"_index":"oci","_id":38}}
{"id":38,"title":"OCI Data Science","category":"Data and Analytics","url":"https://www.oracle.com/data-science/","text":"Build and evaluate higher-quality machine learning (ML) models. Increase business flexibility by putting enterprise-trusted data to work quickly and support data-driven business objectives with easier deployment of ML models."}
{"index":{"_index":"oci","_id":39}}
{"id":39,"title":"OCI Data Catalog","category":"Data and Analytics","url":"https://www.oracle.com/big-data/data-catalog/","text":"Oracle Cloud Infrastructure (OCI) Data Catalog is a metadata management service that helps data professionals discover data and support data governance. Designed specifically to work well with the Oracle ecosystem, it provides an inventory of assets, a business glossary, and a common metastore for data lakes."}
{"index":{"_index":"oci","_id":40}}
{"id":40,"title":"OCI Events","category":"Messaging and Notifications","url":"https://www.oracle.com/cloud-native/events-service/","text":"Oracle Cloud Infrastructure Events Service tracks resource changes using events that comply with the Cloud Native Computing Foundation (CNCF) CloudEvents standard. Developers can respond to changes in real-time by triggering code with Functions, writing to Streaming, or sending alerts using Notifications."}
{"index":{"_index":"oci","_id":41}}
{"id":41,"title":"OCI Streaming","category":"Messaging and Notifications","url":"https://www.oracle.com/cloud-native/streaming/","text":"Streaming service is a real-time, serverless, Apache Kafka-compatible event streaming platform for developers and data scientists. Streaming is tightly integrated with Oracle Cloud Infrastructure (OCI), Database, GoldenGate, and Integration Cloud. The service also provides out-of-the-box integrations for hundreds of third-party products across categories such as DevOps, databases, big data, and SaaS applications."}
{"index":{"_index":"oci","_id":42}}
{"id":42,"title":"OCI Notifications","category":"Messaging and Notifications","url":"https://www.oracle.com/devops/notifications/","text":"Oracle Cloud Infrastructure (OCI) Notifications is a highly available, low-latency publish/subscribe (pub/sub) service that sends alerts and messages to Oracle Functions, email, SMS, and message delivery partners, including Slack, PagerDuty, and ServiceNow. The service integrates with Oracle Identity and Access Management for secure access, and delivers each message, even during traffic bursts."}
{"index":{"_index":"oci","_id":43}}
{"id":43,"title":"OCI Monitoring","category":"Management","url":"https://www.oracle.com/devops/monitoring/","text":"Oracle Cloud Infrastructure Monitoring helps organizations optimize the resource utilization and uptime of their infrastructure and applications. This service provides fine-grained, out-of-the-box metrics and dashboards, enabling DevOps, IT, and Site Reliability Engineers (SREs) with the real-time insights to respond to anomalies as they occur."}
{"index":{"_index":"oci","_id":44}}
{"id":44,"title":"OCI Logging","category":"Management","url":"https://www.oracle.com/devops/logging/","text":"DevOps customers can easily review log data, diagnose issues, and use the rules engine to trigger serverless Functions or alerts with Oracle Cloud Infrastructure (OCI) Logging. Built on open standards, OCI Logging is an intuitive, centralized platform for all types of logs, such as audit, infrastructure, database and applications, which are needed for DevOps and security compliance."}
{"index":{"_index":"oci","_id":45}}
{"id":45,"title":"OCI Resource Manager","category":"Management","url":"https://www.oracle.com/devops/resource-manager/","text":"Oracle Cloud Infrastructure (OCI) Resource Manager is an Oracle-managed service that automates deployment and operations for all Oracle Cloud Infrastructure resources. Unlike Infrastructure-as-Code (IaC) offerings from other cloud vendors, the service is based on Terraform, a widely used, open source industry standard that allows DevOps engineers to develop and deploy their infrastructure anywhere."}
{"index":{"_index":"oci","_id":46}}
{"id":46,"title":"OCI IAM","category":"Identity and Security","url":"https://www.oracle.com/security/cloud-security/identity-access-cloud/","text":"Manage user access and entitlements for Oracle Cloud Infrastructure and across a wide range of cloud and on-premises applications using a cloud native, identity as a service (IDaaS) platform. Oracle offers a unified cloud identity solution that centers user identity as the security perimeter and helps organizations pursue a zero trust strategy."}
{"index":{"_index":"oci","_id":47}}
{"id":47,"title":"OCI Vault","category":"Identity and Security","url":"https://www.oracle.com/security/cloud-security/key-management/","text":"Centrally manage and maintain control of the encryption keys that protect enterprise data and the secret credentials used to securely access key vault resources."}
{"index":{"_index":"oci","_id":48}}
{"id":48,"title":"OCI Audit","category":"Identity and Security","url":"https://docs.oracle.com/en-us/iaas/Content/Audit/Concepts/auditoverview.htm","text":"The Oracle Cloud Infrastructure Audit service automatically records calls to all supported Oracle Cloud Infrastructure public application programming interface (API) endpoints as log events. Currently, all services support logging by Audit. Object Storage service supports logging for bucket-related events, but not for object-related events. Log events recorded by the Audit service include API calls made by the Oracle Cloud Infrastructure Console, Command Line Interface (CLI), Software Development Kits (SDK), your own custom clients, or other Oracle Cloud Infrastructure services. "}
{"index":{"_index":"oci","_id":49}}
{"id":49,"title":"OCI Cloud Guard","category":"Identity and Security","url":"https://www.oracle.com/security/cloud-security/cloud-guard/","text":"Gain a unified view of cloud security posture across Oracle Cloud Infrastructure customer tenants. Oracle Cloud Guard, including the new Threat Detector, detects misconfigured resources, insecure activity across tenants, and malicious threat activities and provides security administrators with the visibility to triage and resolve cloud security issues."}
{"index":{"_index":"oci","_id":50}}
{"id":50,"title":"OCI Anomaly Detection","category":"AI","url":"https://www.oracle.com/artificial-intelligence/anomaly-detection/","text":"Oracle Cloud Infrastructure (OCI) Anomaly Detection is an AI service that enables developers to more easily build business-specific anomaly detection models that flag critical incidents, resulting in faster time to detection and resolution. Specialized APIs and automated model selection simplify training and deploying anomaly detection models to applications and operations-all without data science expertise."}
{"index":{"_index":"oci","_id":51}}
{"id":51,"title":"OCI Vision","category":"AI","url":"https://www.oracle.com/artificial-intelligence/vision/","text":"Oracle Cloud Infrastructure (OCI) Vision is an AI service for performing deep-learning-based image analysis at scale. With prebuilt models available out of the box, developers can easily build image recognition and text recognition into their applications without machine learning (ML) expertise. For industry-specific use cases, developers can automatically train custom vision models with their own data. These models can be used to detect visual anomalies in manufacturing, extract text from documents to automate business workflows, and tag items in images to count products or shipments."}
{"index":{"_index":"oci","_id":52}}
{"id":52,"title":"OCI Speech","category":"AI","url":"https://www.oracle.com/artificial-intelligence/speech/","text":"Oracle Cloud Infrastructure (OCI) Speech is an AI service that applies ASR (Automatic Speech Recognition) technology to transform audio-based content to text. Developers can easily make API calls to integrate OCI Speech's pretrained models into their applications. OCI Speech can be used for accurate, text-normalized, time-stamped transcription via the Console and REST APIs as well as CLI or SDKs. You can also use OCI Speech in a Data Science notebook session. With OCI Speech, you can filter profanities, get confidence scores for both single words and complete transcriptions, and more."}
{"index":{"_index":"oci","_id":53}}
{"id":53,"title":"OCI Language","category":"AI","url":"https://www.oracle.com/artificial-intelligence/language/","text":"Oracle Cloud Infrastructure (OCI) Language is a new AI service for performing sophisticated text analysis at scale. With pre-trained models built in, developers don't need machine learning expertise to build sentiment analysis, key-phrase extraction, text classification, named entity recognitions and more into their applications."}
{"index":{"_index":"oci","_id":54}}
{"id":54,"title":"Oracle Digital Assistant","category":"AI","url":"https://www.oracle.com/chatbots/","text":"Oracle Digital Assistant is an AI service that offers prebuilt skills and templates to create conversational experiences for your business applications and customers through text, chat, and voice interfaces. Application owners can easily get started with prebuilt skills to provide chatbot functionality to business users. Developers can build on the library of templates and create their own custom skills to automate the customer experiences."}
